FROM python:3.9-alpine3.16
# базовий image на основі якого ми створимо свій image

COPY requirements.txt /temp/requirements.txt
# копіюємо файл requirements.txt в папочку temp
COPY service /service
# копіюємо service в корінь докер контейнеру
WORKDIR /service
# WORKDIR потрібна для того щоб коли ми передавали якісь команди всередину докер контейнеру щоб вони запускались з цієї самої директорії, а точніше з service, де лежить на джанго додаток
EXPOSE 8000
# відкриваємо порт, всередині докер контейнеру прокидаємо 8000-ми тисячний порт щоб ми мали до нього доступ з нашої операційної системи

RUN apk add postgresql-client build-base postgresql-dev
# 3 пакети щоб нормально підключатись до постгресу


RUN pip install -r /temp/requirements.txt
# команда установки залежностей

RUN adduser --disabled-password service-user
# команда для створення користувача в операційній системі

USER service-user
# користувач під яким усі команди повинні запускатись, щоб вони не запускались під рутом



# створення основного image(образу) для нашого проекту на основі якого ми будемо запускати декілька докер сервісів